## Groupby pandas

In [1]:
import pandas as pd

In [3]:
var = pd.DataFrame({"Name":["a","b","c","d","a","b","a","b","a","c","c","d"],
                    "s1":[12,13,14,12,13,14,15,23,25,16,10,34],
                    "s2":[23,24,25,26,27,28,29,30,25,34,35,56]})

var

   Name  s1  s2
0     a  12  23
1     b  13  24
2     c  14  25
3     d  12  26
4     a  13  27
5     b  14  28
6     a  15  29
7     b  23  30
8     a  25  25
9     c  16  34
10    c  10  35
11    d  34  56

In [4]:
var1 = var.groupby("Name")
var1

In [6]:
for x,y in var1:
    print(x)
    print(y)

a
  Name  s1  s2
0    a  12  23
4    a  13  27
6    a  15  29
8    a  25  25
b
  Name  s1  s2
1    b  13  24
5    b  14  28
7    b  23  30
c
   Name  s1  s2
2     c  14  25
9     c  16  34
10    c  10  35
d
   Name  s1  s2
3     d  12  26
11    d  34  56

In [7]:
## how to get any particular data
var1.get_group("a")

  Name  s1  s2
0    a  12  23
4    a  13  27
6    a  15  29
8    a  25  25

In [8]:
## how to get any particular data
var1.get_group("d")

   Name  s1  s2
3     d  12  26
11    d  34  56

## Find Minimum, Maximum, and Mean data

In [9]:
## maximum
var1.max()

      s1  s2
Name
a     25  29
b     23  30
c     16  35
d     34  56

In [10]:
## minimum
var1.min()

      s1  s2
Name
a     12  23
b     13  24
c     10  25
d     12  26

In [11]:
var1.mean()

             s1         s2
Name
a     16.250000  26.000000
b     16.666667  27.333333
c     13.333333  31.333333
d     23.000000  41.000000

Convert it into list

In [12]:
li = list(var1)
li

[('a',
    Name  s1  s2
  0    a  12  23
  4    a  13  27
  6    a  15  29
  8    a  25  25),
 ('b',
    Name  s1  s2
  1    b  13  24
  5    b  14  28
  7    b  23  30),
 ('c',
     Name  s1  s2
  2     c  14  25
  9     c  16  34
  10    c  10  35),
 ('d',
     Name  s1  s2
  3     d  12  26
  11    d  34  56)]

In [13]:
li = tuple(var1)
li

(('a',
    Name  s1  s2
  0    a  12  23
  4    a  13  27
  6    a  15  29
  8    a  25  25),
 ('b',
    Name  s1  s2
  1    b  13  24
  5    b  14  28
  7    b  23  30),
 ('c',
     Name  s1  s2
  2     c  14  25
  9     c  16  34
  10    c  10  35),
 ('d',
     Name  s1  s2
  3     d  12  26
  11    d  34  56))